---
kind: property
id: P:Autodesk.Revit.DB.View.SunAndShadowSettings
zh: 视图
source: html/899dbf41-8961-7f31-2810-bffb87b32dd2.htm
---
# Autodesk.Revit.DB.View.SunAndShadowSettings Property

**中文**: 视图

The sun and shadow settings assigned to the view for shadow calculation and rendering.

## Syntax (C#)
```csharp
public SunAndShadowSettings SunAndShadowSettings { get; }
```